sleemanj/ATTinyCore/avr/boards.txt
attinyx7opti.name=ATtiny167/87 (Optiboot)
attinyx7opti.upload.maximum_data_size=512
attinyx7opti.upload.protocol=arduino
attinyx7opti.upload.tool=avrdude
attinyx7opti.build.board=AVR_ATTINYX7
attinyx7opti.bootloader.tool=avrdude
attinyx7opti.bootloader.unlock_bits=0xFF
attinyx7opti.bootloader.lock_bits=0xFF
attinyx7opti.build.core=tiny
attinyx7opti.bootloader.extended_fuses=0xFE
attinyx7opti.menu.LTO.enable=Enabled
attinyx7opti.menu.LTO.enable.ltocflags=-flto -DLTO_ENABLED -fno-fat-lto-objects
attinyx7opti.menu.LTO.enable.ltoelfflags=-flto -DLTO_ENABLED -fuse-linker-plugin
attinyx7opti.menu.LTO.enable.ltocppflags=-flto -DLTO_ENABLED
attinyx7opti.menu.LTO.enable.ltoarcmd=gcc-
attinyx7opti.menu.LTO.disable=Disabled
attinyx7opti.menu.LTO.disable.ltocflags=
attinyx7opti.menu.LTO.disable.ltoelfflags=
attinyx7opti.menu.LTO.disable.ltocppflags=
attinyx7opti.menu.LTO.disable.ltoarcmd=
attinyx7opti.menu.chip.167=ATtiny167
attinyx7opti.menu.chip.167.build.mcu=attiny167
attinyx7opti.menu.chip.167.build.export_merged_output=false
attinyx7opti.menu.chip.167.upload.maximum_size=15744
attinyx7opti.menu.chip.87=ATtiny87
attinyx7opti.menu.chip.87.build.mcu=attiny87
attinyx7opti.menu.chip.87.build.export_merged_output=true
attinyx7opti.menu.chip.87.upload.maximum_size=7552
attinyx7opti.bootloader.file=optiboot/optiboot_{build.mcu}_{build.f_cpu}.hex
attinyx7opti.menu.clock.8internal=8 MHz (internal)
attinyx7opti.menu.clock.8internal.bootloader.low_fuses=0xE2
attinyx7opti.menu.clock.8internal.build.f_cpu=8000000L
attinyx7opti.menu.clock.8internal.upload.speed=57600
attinyx7opti.menu.clock.8internal.build.clocksource=0
attinyx7opti.menu.clock.16external=16 MHz (external)
attinyx7opti.menu.clock.16external.bootloader.low_fuses=0xFF
attinyx7opti.menu.clock.16external.build.f_cpu=16000000L
attinyx7opti.menu.clock.16external.upload.speed=115200
attinyx7opti.menu.clock.16external.build.clocksource=1
attinyx7opti.menu.clock.12external=12 MHz (external)
attinyx7opti.menu.clock.12external.bootloader.low_fuses=0xFF
attinyx7opti.menu.clock.12external.build.f_cpu=12000000L
attinyx7opti.menu.clock.12external.upload.speed=115200
attinyx7opti.menu.clock.12external.build.clocksource=1
attinyx7opti.menu.clock.8external=8 MHz (external)
attinyx7opti.menu.clock.8external.bootloader.low_fuses=0xFD
attinyx7opti.menu.clock.8external.build.f_cpu=8000000L
attinyx7opti.menu.clock.8external.upload.speed=57600
attinyx7opti.menu.clock.8external.build.clocksource=1
attinyx7opti.menu.clock.737external=7.3728 MHz (external)
attinyx7opti.menu.clock.737external.bootloader.low_fuses=0xFD
attinyx7opti.menu.clock.737external.build.f_cpu=7372800L
attinyx7opti.menu.clock.737external.upload.speed=57600
attinyx7opti.menu.clock.737external.build.clocksource=1
attinyx7opti.menu.clock.921external=9.216 MHz (external)
attinyx7opti.menu.clock.921external.bootloader.low_fuses=0xFF
attinyx7opti.menu.clock.921external.build.f_cpu=9216000L
attinyx7opti.menu.clock.921external.upload.speed=57600
attinyx7opti.menu.clock.921external.build.clocksource=1
attinyx7opti.menu.clock.110external=11.0592 MHz (external)
attinyx7opti.menu.clock.110external.bootloader.low_fuses=0xFF
attinyx7opti.menu.clock.110external.build.f_cpu=11059200L
attinyx7opti.menu.clock.110external.upload.speed=115200
attinyx7opti.menu.clock.110external.build.clocksource=1
attinyx7opti.menu.clock.147external=14.7456 MHz (external)
attinyx7opti.menu.clock.147external.bootloader.low_fuses=0xFF
attinyx7opti.menu.clock.147external.build.f_cpu=14745600L
attinyx7opti.menu.clock.147external.upload.speed=115200
attinyx7opti.menu.clock.147external.build.clocksource=1
attinyx7opti.menu.clock.184external=18.432 MHz (external - overclocked)
attinyx7opti.menu.clock.184external.bootloader.low_fuses=0xFF
attinyx7opti.menu.clock.184external.build.f_cpu=18432000L
attinyx7opti.menu.clock.184external.upload.speed=115200
attinyx7opti.menu.clock.184external.build.clocksource=1
attinyx7opti.menu.bod.disable=B.O.D. Disabled (saves power)
attinyx7opti.menu.bod.disable.bootloader.high_fuses=0xD7
attinyx7opti.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx7opti.menu.bod.1v8.bootloader.high_fuses=0xD6
attinyx7opti.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx7opti.menu.bod.2v7.bootloader.high_fuses=0xD5
attinyx7opti.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx7opti.menu.bod.4v3.bootloader.high_fuses=0xD4
attinyx7opti.menu.pinmapping.new=New style (down each side)
attinyx7opti.menu.pinmapping.new.build.variant=tinyX7_New
attinyx7opti.menu.pinmapping.old=Legacy (SCL on 13)
attinyx7opti.menu.pinmapping.old.build.variant=tinyX7
attinyx7opti.menu.pinmapping.digi=DigiSpark Pro
attinyx7opti.menu.pinmapping.digi.build.variant=tinyX7_DigiSpark
attinyx7opti.menu.millis.enabled=Enabled
attinyx7opti.menu.millis.disabled=Disabled (saves flash)
attinyx7opti.menu.millis.enabled.build.millis=
attinyx7opti.menu.millis.disabled.build.millis=-DDISABLEMILLIS
attinyx7opti.menu.neopixelport.porta=Port A (see chart)
attinyx7opti.menu.neopixelport.portb=Port B (see chart)
attinyx7opti.menu.neopixelport.porta.build.neopixelport=-DNEOPIXELPORT=PORTA
attinyx7opti.menu.neopixelport.portb.build.neopixelport=-DNEOPIXELPORT=PORTB
attinyx7opti.build.extra_flags={build.millis} {build.neopixelport}


attinyx7micr.name=ATtiny167 (Micronucleus / DigiSpark Pro)
attinyx7micr.upload.maximum_size=14842
attinyx7micr.upload.maximum_data_size=496
attinyx7micr.upload.tool=micronucleus
attinyx7micr.upload.protocol=usb
attinyx7micr.build.board=AVR_ATTINYX7
attinyx7micr.bootloader.unlock_bits=0xFF
attinyx7micr.bootloader.lock_bits=0xFF
attinyx7micr.build.core=tiny
attinyx7micr.bootloader.extended_fuses=0xFE
attinyx7micr.menu.LTO.enable=Enabled
attinyx7micr.menu.LTO.enable.ltocflags=-flto -fno-fat-lto-objects
attinyx7micr.menu.LTO.enable.ltoelfflags=-g -flto -fuse-linker-plugin
attinyx7micr.menu.LTO.enable.ltocppflags=-flto
attinyx7micr.menu.LTO.enable.ltoarcmd=gcc-
attinyx7micr.menu.LTO.disable=Disabled
attinyx7micr.menu.LTO.disable.ltocflags=
attinyx7micr.menu.LTO.disable.ltoelfflags=
attinyx7micr.menu.LTO.disable.ltocppflags=
attinyx7micr.menu.LTO.disable.ltoarcmd=
attinyx7micr.build.mcu=attiny167
attinyx7micr.build.export_merged_output=false
attinyx7micr.bootloader.low_fuses=0xFF
attinyx7micr.build.f_cpu=16000000L
attinyx7micr.build.clocksource=1
attinyx7micr.menu.bod.disable=B.O.D. Disabled (saves power)
attinyx7micr.menu.bod.disable.bootloader.high_fuses=0xD7
attinyx7micr.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx7micr.menu.bod.4v3.bootloader.high_fuses=0xD4
attinyx7micr.menu.pinmapping.digi=DigiSpark Pro
attinyx7micr.menu.pinmapping.digi.build.variant=tinyX7_DigiSpark
attinyx7micr.menu.pinmapping.new=New style (down each side)
attinyx7micr.menu.pinmapping.new.build.variant=tinyX7_New
attinyx7micr.menu.pinmapping.old=Legacy (SCL on 13)
attinyx7micr.menu.pinmapping.old.build.variant=tinyX7
attinyx7micr.menu.millis.enabled=Enabled
attinyx7micr.menu.millis.disabled=Disabled (saves flash)
attinyx7micr.menu.millis.enabled.build.millis=
attinyx7micr.menu.millis.disabled.build.millis=-DDISABLEMILLIS
attinyx7micr.menu.neopixelport.porta=Port A (see chart)
attinyx7micr.menu.neopixelport.portb=Port B (see chart)
attinyx7micr.menu.neopixelport.porta.build.neopixelport=-DNEOPIXELPORT=PORTA
attinyx7micr.menu.neopixelport.portb.build.neopixelport=-DNEOPIXELPORT=PORTB
attinyx7micr.menu.burnmode.upgrade=Upgrade (via USB)
attinyx7micr.menu.burnmode.upgrade.bootloader.file=micronucleus/upgrade-t167_entry_on_power_on_no_pullup_fast_exit_on_no_USB.hex
attinyx7micr.menu.burnmode.upgrade.bootloader.tool=micronucleus
attinyx7micr.menu.burnmode.install=Fresh Install (via ISP)
attinyx7micr.menu.burnmode.install.bootloader.file=micronucleus/t167_entry_on_power_on_no_pullup_fast_exit_on_no_USB.hex
attinyx7micr.menu.burnmode.install.bootloader.tool=avrdude
attinyx7micr.menu.resetpin.reset=Reset
attinyx7micr.menu.resetpin.reset.bootloader.rstbit=1
attinyx7micr.menu.resetpin.gpio=GPIO (Danger - Read docs first!)
attinyx7micr.menu.resetpin.gpio.bootloader.rstbit=0
attinyx7micr.build.extra_flags={build.millis} {build.neopixelport}


attinyx61.name=ATtiny261/461/861(a)
attinyx61.upload.tool=avrdude
attinyx61.build.board=AVR_ATTINYX61
attinyx61.bootloader.tool=avrdude
attinyx61.bootloader.unlock_bits=0xFF
attinyx61.bootloader.lock_bits=0xFF
attinyx61.bootloader.file=empty/empty_all.hex
attinyx61.build.export_merged_output=false
attinyx61.build.core=tiny
attinyx61.menu.LTO.enable=Enabled
attinyx61.menu.LTO.enable.ltocflags=-flto -DLTO_ENABLED -fno-fat-lto-objects
attinyx61.menu.LTO.enable.ltoelfflags=-flto -DLTO_ENABLED -fuse-linker-plugin
attinyx61.menu.LTO.enable.ltocppflags=-flto -DLTO_ENABLED
attinyx61.menu.LTO.enable.ltoarcmd=gcc-
attinyx61.menu.LTO.disable=Disabled
attinyx61.menu.LTO.disable.ltocflags=
attinyx61.menu.LTO.disable.ltoelfflags=
attinyx61.menu.LTO.disable.ltocppflags=
attinyx61.menu.LTO.disable.ltoarcmd=
attinyx61.menu.TimerClockSource.default=CPU (CPU frequency)
attinyx61.menu.TimerClockSource.default.build.pllsettings=
attinyx61.menu.TimerClockSource.pll=64MHz
attinyx61.menu.TimerClockSource.pll.build.pllsettings=-DPLLTIMER1
attinyx61.menu.TimerClockSource.lowpll=32MHz
attinyx61.menu.TimerClockSource.lowpll.build.pllsettings=-DLOWPLLTIMER1
attinyx61.menu.chip.861=ATtiny861(a)
attinyx61.menu.chip.861.build.mcu=attiny861
attinyx61.menu.chip.861.upload.maximum_size=8192
attinyx61.menu.chip.861.upload.maximum_data_size=512
attinyx61.menu.chip.461=ATtiny461(a)
attinyx61.menu.chip.461.build.mcu=attiny461
attinyx61.menu.chip.461.upload.maximum_size=4096
attinyx61.menu.chip.461.upload.maximum_data_size=256
attinyx61.menu.chip.261=ATtiny261(a)
attinyx61.menu.chip.261.build.mcu=attiny261
attinyx61.menu.chip.261.upload.maximum_size=2048
attinyx61.menu.chip.261.upload.maximum_data_size=128
attinyx61.bootloader.extended_fuses=0xFF
attinyx61.menu.clock.8internal=8 MHz (internal)
attinyx61.menu.clock.8internal.bootloader.low_fuses=0xE2
attinyx61.menu.clock.8internal.build.f_cpu=8000000L
attinyx61.menu.clock.8internal.build.clocksource=0
attinyx61.menu.clock.16pll=16 MHz (PLL)
attinyx61.menu.clock.16pll.bootloader.low_fuses=0xF1
attinyx61.menu.clock.16pll.build.f_cpu=16000000L
attinyx61.menu.clock.16pll.build.clocksource=6
attinyx61.menu.clock.20external=20 MHz (external)
attinyx61.menu.clock.20external.bootloader.low_fuses=0xFF
attinyx61.menu.clock.20external.build.f_cpu=20000000L
attinyx61.menu.clock.20external.build.clocksource=1
attinyx61.menu.clock.16external=16 MHz (external)
attinyx61.menu.clock.16external.bootloader.low_fuses=0xFF
attinyx61.menu.clock.16external.build.f_cpu=16000000L
attinyx61.menu.clock.16external.build.clocksource=1
attinyx61.menu.clock.12external=12 MHz (external)
attinyx61.menu.clock.12external.bootloader.low_fuses=0xFF
attinyx61.menu.clock.12external.build.f_cpu=12000000L
attinyx61.menu.clock.12external.build.clocksource=1
attinyx61.menu.clock.8external=8 MHz (external)
attinyx61.menu.clock.8external.bootloader.low_fuses=0xFF
attinyx61.menu.clock.8external.build.f_cpu=8000000L
attinyx61.menu.clock.8external.build.clocksource=1
attinyx61.menu.clock.6external=6 MHz (external)
attinyx61.menu.clock.6external.bootloader.low_fuses=0xFD
attinyx61.menu.clock.6external.build.f_cpu=6000000L
attinyx61.menu.clock.6external.build.clocksource=1
attinyx61.menu.clock.4external=4 MHz (external)
attinyx61.menu.clock.4external.bootloader.low_fuses=0xFD
attinyx61.menu.clock.4external.build.f_cpu=4000000L
attinyx61.menu.clock.4external.build.clocksource=1
attinyx61.menu.clock.1internal=1 MHz (internal)
attinyx61.menu.clock.1internal.bootloader.low_fuses=0x62
attinyx61.menu.clock.1internal.build.f_cpu=1000000L
attinyx61.menu.clock.1internal.build.clocksource=0
attinyx61.menu.clock.737external=7.372 MHz (external)
attinyx61.menu.clock.737external.bootloader.low_fuses=0xFD
attinyx61.menu.clock.737external.build.f_cpu=7372800L
attinyx61.menu.clock.737external.build.clocksource=1
attinyx61.menu.clock.92external=9.216 MHz (external)
attinyx61.menu.clock.92external.bootloader.low_fuses=0xFF
attinyx61.menu.clock.92external.build.f_cpu=9216000L
attinyx61.menu.clock.92external.build.clocksource=1
attinyx61.menu.clock.11external=11.0592 MHz (external)
attinyx61.menu.clock.11external.bootloader.low_fuses=0xFF
attinyx61.menu.clock.11external.build.f_cpu=11059200L
attinyx61.menu.clock.11external.build.clocksource=1
attinyx61.menu.clock.14external=14.7456 MHz (external)
attinyx61.menu.clock.14external.bootloader.low_fuses=0xFF
attinyx61.menu.clock.14external.build.f_cpu=14745600L
attinyx61.menu.clock.14external.build.clocksource=1
attinyx61.menu.clock.184external=18.432 MHz (external)
attinyx61.menu.clock.184external.bootloader.low_fuses=0xFF
attinyx61.menu.clock.184external.build.f_cpu=18432000L
attinyx61.menu.clock.184external.build.clocksource=1
attinyx61.menu.clock.4internal=4 MHz (internal)
attinyx61.menu.clock.4internal.bootloader.low_fuses=0x62
attinyx61.menu.clock.4internal.build.f_cpu=4000000L
attinyx61.menu.clock.4internal.build.clocksource=0
attinyx61.menu.clock.128internal=128 kHz (internal WDT)
attinyx61.menu.clock.128internal.bootloader.low_fuses=0xC3
attinyx61.menu.clock.128internal.build.f_cpu=128000L
attinyx61.menu.clock.128internal.build.clocksource=3
attinyx61.menu.clock.165pll=16.5 MHz (PLL, tweaked)
attinyx61.menu.clock.165pll.bootloader.low_fuses=0xF1
attinyx61.menu.clock.165pll.build.f_cpu=16500000L
attinyx61.menu.clock.165pll.build.clocksource=6
attinyx61.bootloader.high_fuses=0b1101{bootloader.eesave_bit}{bootloader.bod_bits}
attinyx61.menu.eesave.aenable=EEPROM retained
attinyx61.menu.eesave.aenable.bootloader.eesave_bit=0
attinyx61.menu.eesave.disable=EEPROM not retained
attinyx61.menu.eesave.disable.bootloader.eesave_bit=1
attinyx61.menu.bod.disable=B.O.D. Disabled (saves power)
attinyx61.menu.bod.disable.bootloader.bod_bits=111
attinyx61.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx61.menu.bod.1v8.bootloader.bod_bits=110
attinyx61.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx61.menu.bod.2v7.bootloader.bod_bits=101
attinyx61.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx61.menu.bod.4v3.bootloader.bod_bits=100
attinyx61.build.variant=tinyX61
attinyx61.menu.millis.enabled=Enabled
attinyx61.menu.millis.disabled=Disabled (saves flash)
attinyx61.menu.millis.enabled.build.millis=
attinyx61.menu.millis.disabled.build.millis=-DDISABLEMILLIS
attinyx61.menu.neopixelport.porta=Port A (pins 0~2, 10~14)
attinyx61.menu.neopixelport.portb=Port B (pins 3~9, 15)
attinyx61.menu.neopixelport.porta.build.neopixelport=-DNEOPIXELPORT=PORTA
attinyx61.menu.neopixelport.portb.build.neopixelport=-DNEOPIXELPORT=PORTB
attinyx61.build.extra_flags={build.millis} {build.pllsettings} {build.neopixelport}

