sleemanj/ATTinyCore/avr/boards.txt
attinyx61opti.name=ATtiny461/861(a) (Optiboot)
attinyx61opti.upload.tool=avrdude
attinyx61opti.upload.protocol=arduino
attinyx61opti.upload.speed=19200
attinyx61opti.build.board=AVR_ATTINYX61
attinyx61opti.bootloader.tool=avrdude
attinyx61opti.bootloader.unlock_bits=0xFF
attinyx61opti.bootloader.lock_bits=0xFF
attinyx61opti.bootloader.file=optiboot/optiboot_{build.mcu}_{build.f_cpu}.hex
attinyx61opti.build.core=tiny
attinyx61opti.build.export_merged_output=false
attinyx61opti.menu.LTO.enable=Enabled
attinyx61opti.menu.LTO.enable.ltocflags=-flto -fno-fat-lto-objects
attinyx61opti.menu.LTO.enable.ltoelfflags=-g -flto -fuse-linker-plugin
attinyx61opti.menu.LTO.enable.ltocppflags=-flto
attinyx61opti.menu.LTO.enable.ltoarcmd=gcc-
attinyx61opti.menu.LTO.disable=Disabled
attinyx61opti.menu.LTO.disable.ltocflags=
attinyx61opti.menu.LTO.disable.ltoelfflags=
attinyx61opti.menu.LTO.disable.ltocppflags=
attinyx61opti.menu.LTO.disable.ltoarcmd=
attinyx61opti.menu.TimerClockSource.default=CPU (CPU frequency)
attinyx61opti.menu.TimerClockSource.default.build.pllsettings=
attinyx61opti.menu.TimerClockSource.pll=64MHz
attinyx61opti.menu.TimerClockSource.pll.build.pllsettings=-DPLLTIMER1
attinyx61opti.menu.TimerClockSource.lowpll=32MHz
attinyx61opti.menu.TimerClockSource.lowpll.build.pllsettings=-DLOWPLLTIMER1
attinyx61opti.menu.chip.861=ATtiny861(a)
attinyx61opti.menu.chip.861.build.mcu=attiny861
attinyx61opti.menu.chip.861.upload.maximum_size=7552
attinyx61opti.menu.chip.861.upload.maximum_data_size=512
attinyx61opti.menu.chip.461=ATtiny461(a)
attinyx61opti.menu.chip.461.build.mcu=attiny461
attinyx61opti.menu.chip.461.upload.maximum_size=3456
attinyx61opti.menu.chip.461.upload.maximum_data_size=256
attinyx61opti.bootloader.extended_fuses=0xFE
attinyx61opti.menu.clock.8internal=8 MHz (internal)
attinyx61opti.menu.clock.8internal.bootloader.low_fuses=0xE2
attinyx61opti.menu.clock.8internal.build.f_cpu=8000000L
attinyx61opti.menu.clock.8internal.build.clocksource=0
attinyx61opti.menu.clock.16pll=16 MHz (PLL)
attinyx61opti.menu.clock.16pll.bootloader.low_fuses=0xF1
attinyx61opti.menu.clock.16pll.build.f_cpu=16000000L
attinyx61opti.menu.clock.16pll.build.clocksource=6
attinyx61opti.menu.clock.20external=20 MHz (external)
attinyx61opti.menu.clock.20external.bootloader.low_fuses=0xFF
attinyx61opti.menu.clock.20external.build.f_cpu=20000000L
attinyx61opti.menu.clock.20external.build.clocksource=1
attinyx61opti.menu.clock.16external=16 MHz (external)
attinyx61opti.menu.clock.16external.bootloader.low_fuses=0xFF
attinyx61opti.menu.clock.16external.build.f_cpu=16000000L
attinyx61opti.menu.clock.16external.build.clocksource=1
attinyx61opti.menu.clock.12external=12 MHz (external)
attinyx61opti.menu.clock.12external.bootloader.low_fuses=0xFF
attinyx61opti.menu.clock.12external.build.f_cpu=12000000L
attinyx61opti.menu.clock.8internal.build.clocksource=1
attinyx61opti.menu.clock.8external=8 MHz (external)
attinyx61opti.menu.clock.8external.bootloader.low_fuses=0xFF
attinyx61opti.menu.clock.8external.build.f_cpu=8000000L
attinyx61opti.menu.clock.8external.build.clocksource=1
attinyx61opti.menu.clock.737external=7.372 MHz (external)
attinyx61opti.menu.clock.737external.bootloader.low_fuses=0xFD
attinyx61opti.menu.clock.737external.build.f_cpu=7372800L
attinyx61opti.menu.clock.737external.build.clocksource=1
attinyx61opti.menu.clock.92external=9.216 MHz (external)
attinyx61opti.menu.clock.92external.bootloader.low_fuses=0xFF
attinyx61opti.menu.clock.92external.build.f_cpu=9216000L
attinyx61opti.menu.clock.92external.build.clocksource=1
attinyx61opti.menu.clock.11external=11.0592 MHz (external)
attinyx61opti.menu.clock.11external.bootloader.low_fuses=0xFF
attinyx61opti.menu.clock.11external.build.f_cpu=11059200L
attinyx61opti.menu.clock.11external.build.clocksource=1
attinyx61opti.menu.clock.14external=14.7456 MHz (external)
attinyx61opti.menu.clock.14external.bootloader.low_fuses=0xFF
attinyx61opti.menu.clock.14external.build.f_cpu=14745600L
attinyx61opti.menu.clock.14external.build.clocksource=1
attinyx61opti.menu.clock.184external=18.432 MHz (external)
attinyx61opti.menu.clock.184external.bootloader.low_fuses=0xFF
attinyx61opti.menu.clock.184external.build.f_cpu=18432000L
attinyx61opti.menu.clock.184external.build.clocksource=1
attinyx61opti.bootloader.high_fuses=0b11011{bootloader.bod_bits}
attinyx61opti.menu.bod.disable=B.O.D. Disabled (saves power)
attinyx61opti.menu.bod.disable.bootloader.bod_bits=111
attinyx61opti.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx61opti.menu.bod.1v8.bootloader.bod_bits=110
attinyx61opti.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx61opti.menu.bod.2v7.bootloader.bod_bits=101
attinyx61opti.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx61opti.menu.bod.4v3.bootloader.bod_bits=100
attinyx61opti.build.variant=tinyX61
attinyx61opti.menu.millis.enabled=Enabled
attinyx61opti.menu.millis.disabled=Disabled (saves flash)
attinyx61opti.menu.millis.enabled.build.millis=
attinyx61opti.menu.millis.disabled.build.millis=-DDISABLEMILLIS
attinyx61opti.menu.neopixelport.porta=Port A (pins 0~2, 10~14)
attinyx61opti.menu.neopixelport.portb=Port B (pins 3~9, 15)
attinyx61opti.menu.neopixelport.porta.build.neopixelport=-DNEOPIXELPORT=PORTA
attinyx61opti.menu.neopixelport.portb.build.neopixelport=-DNEOPIXELPORT=PORTB
attinyx61opti.build.extra_flags={build.millis} {build.pllsettings} {build.neopixelport}


attinyx41.name=ATtiny441/841 (No bootloader)
attinyx41.upload.tool=avrdude
attinyx41.bootloader.tool=avrdude
attinyx41.bootloader.unlock_bits=0xFF
attinyx41.bootloader.lock_bits=0xFF
attinyx41.bootloader.file=empty/empty_all.hex
attinyx41.build.core=tinymodern
attinyx41.build.speedfix=
attinyx41.build.board=AVR_ATTINYX41
attinyx41.build.export_merged_output=false
attinyx41.menu.chip.841=ATtiny841
attinyx41.menu.chip.841.build.mcu=attiny841
attinyx41.menu.chip.841.upload.maximum_size=8192
attinyx41.menu.chip.841.upload.maximum_data_size=512
attinyx41.menu.chip.441=ATtiny441
attinyx41.menu.chip.441.build.mcu=attiny441
attinyx41.menu.chip.441.upload.maximum_size=4096
attinyx41.menu.chip.441.upload.maximum_data_size=256
attinyx41.menu.LTO.enable=Enabled
attinyx41.menu.LTO.enable.ltocflags=-flto -DLTO_ENABLED -fno-fat-lto-objects
attinyx41.menu.LTO.enable.ltoelfflags=-flto -DLTO_ENABLED -fuse-linker-plugin
attinyx41.menu.LTO.enable.ltocppflags=-flto -DLTO_ENABLED
attinyx41.menu.LTO.enable.ltoarcmd=gcc-
attinyx41.menu.LTO.disable=Disabled
attinyx41.menu.LTO.disable.ltocflags=
attinyx41.menu.LTO.disable.ltoelfflags=
attinyx41.menu.LTO.disable.ltocppflags=
attinyx41.menu.LTO.disable.ltoarcmd=
attinyx41.menu.clock.8internal5v=8 MHz (internal, Vcc > 4.5V )
attinyx41.menu.clock.8internal5v.bootloader.low_fuses=0xE2
attinyx41.menu.clock.8internal5v.bootloader.ulp_bits=111
attinyx41.menu.clock.8internal5v.build.f_cpu=8000000L
attinyx41.menu.clock.8internal5v.build.clocksource=0
attinyx41.menu.clock.8internal5v.build.speedfix=-DLOWERCAL
attinyx41.menu.clock.8internal=8 MHz (internal, Vcc < 4.5V )
attinyx41.menu.clock.8internal.bootloader.low_fuses=0xE2
attinyx41.menu.clock.8internal.bootloader.ulp_bits=111
attinyx41.menu.clock.8internal.build.f_cpu=8000000L
attinyx41.menu.clock.8internal.build.clocksource=0
attinyx41.menu.clock.16internal=16 MHz (internal, warning - see docs!)
attinyx41.menu.clock.16internal.bootloader.low_fuses=0xE2
attinyx41.menu.clock.16internal.bootloader.ulp_bits=111
attinyx41.menu.clock.16internal.build.f_cpu=8000000L
attinyx41.menu.clock.16internal.build.clocksource=0
attinyx41.menu.clock.16external=16 MHz (external)
attinyx41.menu.clock.16external.bootloader.low_fuses=0xEE
attinyx41.menu.clock.16external.bootloader.ulp_bits=111
attinyx41.menu.clock.16external.build.f_cpu=16000000L
attinyx41.menu.clock.16external.build.clocksource=1
attinyx41.menu.clock.12external=12 MHz (external)
attinyx41.menu.clock.12external.bootloader.low_fuses=0xEE
attinyx41.menu.clock.12external.bootloader.ulp_bits=111
attinyx41.menu.clock.12external.build.f_cpu=12000000L
attinyx41.menu.clock.12external.build.clocksource=1
attinyx41.menu.clock.8external=8 MHz (external)
attinyx41.menu.clock.8external.bootloader.low_fuses=0xED
attinyx41.menu.clock.8external.bootloader.ulp_bits=111
attinyx41.menu.clock.8external.build.f_cpu=8000000L
attinyx41.menu.clock.8external.build.clocksource=1
attinyx41.menu.clock.737external=7.372 MHz (external)
attinyx41.menu.clock.737external.bootloader.low_fuses=0xED
attinyx41.menu.clock.737external.bootloader.ulp_bits=111
attinyx41.menu.clock.737external.build.f_cpu=7372800L
attinyx41.menu.clock.737external.build.clocksource=1
attinyx41.menu.clock.92external=9.216 MHz (external)
attinyx41.menu.clock.92external.bootloader.low_fuses=0xEE
attinyx41.menu.clock.92external.bootloader.ulp_bits=111
attinyx41.menu.clock.92external.build.f_cpu=9216000L
attinyx41.menu.clock.92external.build.clocksource=1
attinyx41.menu.clock.11external=11.0592 MHz (external)
attinyx41.menu.clock.11external.bootloader.low_fuses=0xEE
attinyx41.menu.clock.11external.bootloader.ulp_bits=111
attinyx41.menu.clock.11external.build.f_cpu=11059200L
attinyx41.menu.clock.11external.build.clocksource=1
attinyx41.menu.clock.14external=14.7456 MHz (external)
attinyx41.menu.clock.14external.bootloader.low_fuses=0xEE
attinyx41.menu.clock.14external.bootloader.ulp_bits=111
attinyx41.menu.clock.14external.build.f_cpu=14745600L
attinyx41.menu.clock.14external.build.clocksource=1
attinyx41.menu.clock.184external=18.432 MHz (external - overclocked)
attinyx41.menu.clock.184external.bootloader.low_fuses=0xEE
attinyx41.menu.clock.184external.bootloader.ulp_bits=111
attinyx41.menu.clock.184external.build.f_cpu=18432000L
attinyx41.menu.clock.184external.build.clocksource=1
attinyx41.menu.clock.1internal5v=1 MHz (internal, Vcc > 4.5V )
attinyx41.menu.clock.1internal5v.bootloader.low_fuses=0x62
attinyx41.menu.clock.1internal5v.bootloader.ulp_bits=111
attinyx41.menu.clock.1internal5v.build.f_cpu=1000000L
attinyx41.menu.clock.1internal5v.build.clocksource=0
attinyx41.menu.clock.1internal5v.build.speedfix=-DLOWERCAL
attinyx41.menu.clock.1internal=1 MHz (internal, Vcc < 4.5V )
attinyx41.menu.clock.1internal.bootloader.low_fuses=0x62
attinyx41.menu.clock.1internal.bootloader.ulp_bits=111
attinyx41.menu.clock.1internal.build.f_cpu=1000000L
attinyx41.menu.clock.1internal.build.clocksource=0
attinyx41.menu.clock.4internal5v=4 MHz (internal, Vcc > 4.5V )
attinyx41.menu.clock.4internal5v.bootloader.low_fuses=0x62
attinyx41.menu.clock.4internal5v.bootloader.ulp_bits=111
attinyx41.menu.clock.4internal5v.build.f_cpu=4000000L
attinyx41.menu.clock.4internal5v.build.clocksource=0
attinyx41.menu.clock.4internal5v.build.speedfix=-DLOWERCAL
attinyx41.menu.clock.4internal=4 MHz (internal, Vcc < 4.5V )
attinyx41.menu.clock.4internal.bootloader.low_fuses=0x62
attinyx41.menu.clock.4internal.bootloader.ulp_bits=111
attinyx41.menu.clock.4internal.build.f_cpu=4000000L
attinyx41.menu.clock.4internal.build.clocksource=0
attinyx41.menu.clock.20external=20 MHz (external - overclocked)
attinyx41.menu.clock.20external.bootloader.low_fuses=0xEE
attinyx41.menu.clock.20external.bootloader.ulp_bits=111
attinyx41.menu.clock.20external.build.f_cpu=20000000L
attinyx41.menu.clock.20external.build.clocksource=1
attinyx41.menu.clock.6external=6 MHz (external)
attinyx41.menu.clock.6external.bootloader.low_fuses=0xED
attinyx41.menu.clock.6external.bootloader.ulp_bits=111
attinyx41.menu.clock.6external.build.f_cpu=6000000L
attinyx41.menu.clock.6external.build.clocksource=1
attinyx41.menu.clock.4external=4 MHz (external)
attinyx41.menu.clock.4external.bootloader.low_fuses=0xED
attinyx41.menu.clock.4external.bootloader.ulp_bits=111
attinyx41.menu.clock.4external.build.f_cpu=4000000L
attinyx41.menu.clock.4external.build.clocksource=1
attinyx41.menu.clock.512internal=512 kHz (internal ULP)
attinyx41.menu.clock.512internal.bootloader.low_fuses=0xE4
attinyx41.menu.clock.512internal.bootloader.ulp_bits=011
attinyx41.menu.clock.512internal.build.f_cpu=512000L
attinyx41.menu.clock.512internal.build.clocksource=4
attinyx41.menu.clock.256internal=256 kHz (internal ULP)
attinyx41.menu.clock.256internal.bootloader.low_fuses=0xE4
attinyx41.menu.clock.256internal.bootloader.ulp_bits=100
attinyx41.menu.clock.256internal.build.f_cpu=256000L
attinyx41.menu.clock.256internal.build.clocksource=4
attinyx41.menu.clock.128internal=128 kHz (internal ULP)
attinyx41.menu.clock.128internal.bootloader.low_fuses=0xE4
attinyx41.menu.clock.128internal.bootloader.ulp_bits=101
attinyx41.menu.clock.128internal.build.f_cpu=128000L
attinyx41.menu.clock.128internal.build.clocksource=4
attinyx41.menu.clock.64internal=64 kHz (internal ULP)
attinyx41.menu.clock.64internal.bootloader.low_fuses=0xE4
attinyx41.menu.clock.64internal.bootloader.ulp_bits=110
attinyx41.menu.clock.64internal.build.f_cpu=64000L
attinyx41.menu.clock.64internal.build.clocksource=4
attinyx41.menu.clock.32internal=32 kHz (internal ULP)
attinyx41.menu.clock.32internal.bootloader.low_fuses=0xE4
attinyx41.menu.clock.32internal.bootloader.ulp_bits=111
attinyx41.menu.clock.32internal.build.f_cpu=32000L
attinyx41.menu.clock.32internal.build.clocksource=4
attinyx41.bootloader.high_fuses=0b1101{bootloader.eesave_bit}{bootloader.bod_bits}
attinyx41.bootloader.extended_fuses=0b{bootloader.ulp_bits}{bootloader.bodpd_bits}{bootloader.bodact_bits}0
attinyx41.menu.eesave.aenable=EEPROM retained
attinyx41.menu.eesave.aenable.bootloader.eesave_bit=0
attinyx41.menu.eesave.disable=EEPROM not retained
attinyx41.menu.eesave.disable.bootloader.eesave_bit=1
attinyx41.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx41.menu.bod.1v8.bootloader.bod_bits=110
attinyx41.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx41.menu.bod.2v7.bootloader.bod_bits=101
attinyx41.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx41.menu.bod.4v3.bootloader.bod_bits=100
attinyx41.menu.bodact.disabled=B.O.D. Disabled (saves power)
attinyx41.menu.bodact.disabled.bootloader.bodact_bits=11
attinyx41.menu.bodact.enabled=B.O.D. Enabled
attinyx41.menu.bodact.enabled.bootloader.bodact_bits=10
attinyx41.menu.bodact.sampled=B.O.D. Sampled Mode
attinyx41.menu.bodact.sampled.bootloader.bodact_bits=01
attinyx41.menu.bodpd.disabled=B.O.D. Disabled (saves power)
attinyx41.menu.bodpd.disabled.bootloader.bodpd_bits=11
attinyx41.menu.bodpd.enabled=B.O.D. Enabled
attinyx41.menu.bodpd.enabled.bootloader.bodpd_bits=10
attinyx41.menu.bodpd.sampled=B.O.D. Sampled Mode
attinyx41.menu.bodpd.sampled.bootloader.bodpd_bits=01
attinyx41.menu.pinmapping.anew=Clockwise (like Rev. D/E boards)
attinyx41.menu.pinmapping.anew.build.pinmap=-DNEW_PINOUT
attinyx41.menu.pinmapping.old=Counterclockwise (like old ATTinyCore and Rev. C boards)
attinyx41.menu.pinmapping.old.build.pinmap=-DOLD_PINOUT
attinyx41.menu.wiremode.amaster=Master Only
attinyx41.menu.wiremode.amaster.build.wiremode=-DWIRE_MASTER_ONLY
attinyx41.menu.wiremode.slave=Slave Only
attinyx41.menu.wiremode.slave.build.wiremode=-DWIRE_SLAVE_ONLY
attinyx41.menu.wiremode.both=Both (uses more flash)
attinyx41.menu.wiremode.both.build.wiremode=-DWIRE_BOTH
attinyx41.menu.millis.enabled=Enabled
attinyx41.menu.millis.disabled=Disabled (saves flash)
attinyx41.menu.millis.enabled.build.millis=
attinyx41.menu.millis.disabled.build.millis=-DDISABLEMILLIS
attinyx41.menu.neopixelport.porta=Port A (CW:0~7,CCW:3~10)
attinyx41.menu.neopixelport.portb=Port B (CW:8~11,CCW:0~2,11)
attinyx41.menu.neopixelport.porta.build.neopixelport=-DNEOPIXELPORT=PORTA
attinyx41.menu.neopixelport.portb.build.neopixelport=-DNEOPIXELPORT=PORTB
attinyx41.build.extra_flags={build.millis} {build.neopixelport} {build.pinmap} {build.wiremode} {build.speedfix}

